# DocumentDifference Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentDifference Properties
DocumentDifference Class See Also
---
The DocumentDifference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreDeletedElementIdsAvailable | Whether or the deleted elements were retrieved. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DocumentDifference Class
Autodesk.Revit.DB Namespace